app/controllers/comments_controller.rb

	 def create
	    @post = Post.find(params[:post_id])
	    @comment = @post.comments.create(comment_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 19 LIMIT 1
INSERT INTO `posts` (`created_at`, `updated_at`, `title`, `content`) VALUES ('2019-04-04 16:49:11', '2019-04-04 16:49:11', 'asdasd', 'sss')
INSERT INTO `comments` (`commenter`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('aaaa', 'aaaa', 25, '2019-04-04 17:07:15', '2019-04-04 17:07:15')

  	def edit
  		@comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 14 LIMIT 1

  	def update
  		@comment = Comment.find(params[:id])
  		@comment.update_attributes(comment_params)
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 14 LIMIT 1
UPDATE `comments` SET `body` = 'aabc', `updated_at` = '2019-04-04 18:06:26' WHERE `comments`.`id` = 14