app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `updated_at`, `user_id`, `title`, `content`, `avatar`) VALUES ('2019-04-05 03:11:42', '2019-04-05 03:11:42', 3, 'abc', 'abc', 'IMG_20190207_131851983.jpg')
---
  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save